fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_Услуги</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция создает документы Реализация товаров и услуг пакетом
//
// Параметры:
// Период - Дата
// 
// Возвращаемое значение:
// Булево
Функция СоздатьРеализацииПакетом(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДоговорыКонтрагентов.Ссылка КАК Договор,
				   |	ДоговорыКонтрагентов.Организация КАК Организация,
				   |	ДоговорыКонтрагентов.Владелец КАК Контрагент
				   |ПОМЕСТИТЬ вт_ДоговорыЗаПериод
				   |ИЗ
				   |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				   |ГДЕ
				   |	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
				   |	И ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
				   |	И ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец >= КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	Реализации.Договор КАК Договор,
				   |	Реализации.Организация КАК Организация,
				   |	Реализации.Контрагент КАК Контрагент,
				   |	Реализации.Реализация КАК Реализация
				   |ИЗ
				   |	(ВЫБРАТЬ
				   |		вт_ДоговорыЗаПериод.Договор КАК Договор,
				   |		РеализацияТоваровУслуг.Ссылка КАК Реализация,
				   |		вт_ДоговорыЗаПериод.Организация КАК Организация,
				   |		вт_ДоговорыЗаПериод.Контрагент КАК Контрагент
				   |	ИЗ
				   |		вт_ДоговорыЗаПериод КАК вт_ДоговорыЗаПериод
				   |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				   |			ПО вт_ДоговорыЗаПериод.Договор = РеализацияТоваровУслуг.Договор
				   |			И (НЕ РеализацияТоваровУслуг.ПометкаУдаления)) КАК Реализации
				   |ГДЕ
				   |	Реализации.Реализация ЕСТЬ NULL";

	Запрос.УстановитьПараметр("Период", Период);

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда

		СозданныеРеализации = Новый Массив;

		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл

			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДанныеЗаполнения = НовыеДанныеЗаполнения(Выборка);
			НоваяРеализация.Заполнить(ДанныеЗаполнения);
			НоваяРеализация.ВыполнитьАвтозаполнение();
			
			Попытка
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
				РеализацияСтруктурой = Новый Структура;
				РеализацияСтруктурой.Вставить("Реализация", НоваяРеализация.Ссылка);
				РеализацияСтруктурой.Вставить("Договор", Выборка.Договор);
				СозданныеРеализации.Добавить(РеализацияСтруктурой);
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка проведения реализации", УровеньЖурналаРегистрации.Ошибка, НоваяРеализация, ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЦикла;
		
		Возврат СозданныеРеализации;
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеДанныеЗаполнения(Выборка)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Договор", Выборка.Договор);
	ДанныеЗаполнения.Вставить("Организация", Выборка.Организация);
	ДанныеЗаполнения.Вставить("Контрагент", Выборка.Контрагент);
	ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());

	Возврат ДанныеЗаполнения;

КонецФункции

#КонецОбласти

#КонецЕсли
